<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"c43f92305f9e852c3a7debfade432e47b5f1c7b16f32e715dc39206339efb21a","plan_job_ref":"Job Write Terraform Plan to Pull Request #96 at https://github.com/hackforla/devops-security/actions/runs/22982552074","plan_out_hash":"67bcc1fdaf43a650544d9f77ba7f2ab799bb0fd33600ae604a95f5238d8d79c6","plan_hash":"b0f0637243fce1458736959e5971dfdae4fd3e8343f36381670e8cb178325e96","plan_text_format":"diff","version":"1.49.0","closed":true} -->
Terraform plan in __terraform__
With backend config files: `terraform/prod.backend.tfvars`
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_iam_role.incubator_tf_apply will be created
+   resource "aws_iam_role" "incubator_tf_apply" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringEquals = {
+                               "token.actions.githubusercontent.com:aud" = "*****************"
                            }
+                           StringLike   = {
+                               "token.actions.githubusercontent.com:sub" = [
+                                   "repo:hackforla/incubator:ref:refs/heads/main",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::035866691871:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "incubator-tf-apply"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # aws_iam_role.incubator_tf_plan will be created
+   resource "aws_iam_role" "incubator_tf_plan" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringEquals = {
+                               "token.actions.githubusercontent.com:aud" = "*****************"
                            }
+                           StringLike   = {
+                               "token.actions.githubusercontent.com:sub" = [
+                                   "repo:hackforla/incubator:ref:refs/heads/*",
+                                   "repo:hackforla/incubator:pull_request",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::035866691871:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "incubator-tf-plan"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.incubator_tf_apply_admin will be created
+   resource "aws_iam_role_policy_attachment" "incubator_tf_apply_admin" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
+       role       = "incubator-tf-apply"
    }

  # aws_iam_role_policy_attachment.incubator_tf_plan_readonly will be created
+   resource "aws_iam_role_policy_attachment" "incubator_tf_plan_readonly" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
+       role       = "incubator-tf-plan"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.iam_oidc_gha_incubator.aws_iam_role.github_actions_oidc,
  on modules/aws-gha-oidc-providers/main.tf line 54, in resource "aws_iam_role" "github_actions_oidc":
  54:   managed_policy_arns = var.policy_arns

managed_policy_arns is deprecated. Use the aws_iam_role_policy_attachment
resource instead. If Terraform should exclusively manage all managed policy
attachments (the current behavior of this argument), use the
aws_iam_role_policy_attachments_exclusive resource as well.
```
</details>

:white_check_mark: Plan applied in [Apply Terraform changes on merge #35](https://github.com/hackforla/devops-security/actions/runs/22982622927)